fix service layer issues
